src/DataProcessors/ПульсБизнеса/ПульсБизнеса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ba3d614b-3fad-429f-9c4f-576f4b253a46">
  <name>ПульсБизнеса</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="91112615-1767-47d9-8493-56f4f6155586">
  <name>Запасы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="f72e33d3-324f-4f94-a330-a919e0f98615">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c7062576-207c-44e8-825d-004e5809e5ae">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="7f9237f1-027e-4670-9ba7-4167ac725dfb">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="74a630ed-a0e3-4e20-874c-32e15365b300">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b2cd2e24-61a2-48a7-b133-f28bf6497017">
    <name>СчетУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3400ef97-0dfb-4ed4-8038-011261a9ace3">
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2c140d47-2059-4f8f-a235-e3e91129b658">
    <name>ЗаказПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="935b3699-2154-4396-beb4-9d3089189c2c">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="49c4fd20-9868-483b-b488-8c57fd046bdc">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="0d19eb74-bf6e-4116-86fe-df31d53de608">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9bbb1a13-6b20-4404-9200-e9443b24ff4a">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e610b9a6-c6a5-4365-bd2e-749d31a6932a">
    <name>Актуальность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="60782cbe-1ea8-49b3-8d12-06b63e48f302">
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a28e04ee-8fae-48f0-b7c4-e031134c920f">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d003232-5e09-4e5c-94f9-008a3b9c38e0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="afd50769-dbc5-49f4-afda-ed7b0aa63e1d">
  <name>ЗаказыПоставщикам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="8513e7df-0b74-4d58-a48c-05b111fded15">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f48b1504-4344-4f68-ae5e-4047600d68ce">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="97578a66-7055-47ce-9765-f07b8ef18280">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7b1188c1-5a03-45a5-aa71-8f18b534afca">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e1fc91ba-749b-428c-bc1b-bcc14e935e98">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="19a9d422-729a-48be-8480-758fe0affd57">
  <name>Продажи</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources extendedConfigurationObject="2b709ea2-8056-456c-904b-dc722eaaa02c">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="26c87d0a-dfb0-46fe-9eaf-249941f994f9">
    <name>Себестоимость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="dd98218b-e2a9-4d0e-a09f-59fdd5f2b7ec">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ce74e11c-fbff-4738-b412-2817d474112a">
    <name>СуммаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9d21b7bd-12e3-4cb5-bbfd-55d45a58d48a">
    <name>СуммаБезСкидки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bbe19ebf-4712-441a-a411-23403b388256">
    <name>КоличествоИнт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3eb639dc-e689-42d3-ac5a-453a5eb72bc7">
    <name>СуммаИнт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fedf21e8-4025-43f4-93e5-bcc3c9b5446b">
    <name>СуммаНДСИнт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="90999c47-431c-452b-802e-1cefa98c3497">
    <name>СуммаБезСкидкиИнт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd8c0a36-5428-4948-85d3-06c4e8343e83">
    <name>СебестоимостьИнт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="91ae51b5-3a57-4cd0-9d1d-1cd41524001a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b41be0bb-c3d9-4714-9af5-4150fef35fb4">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1200f453-74e5-4239-93f3-750bc56e0531">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1a59960d-5474-4c9a-9da4-f759a3095c4d">
    <name>Партия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0370437b-6ab6-45a8-870f-065bb55552d3">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="d251148a-4562-4e4a-82cb-a6d566cd7f8d">
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="df0267de-bf94-47da-af17-489afa4b9ed3">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b30edf4d-c63d-4e56-8ff9-17d1f96ef87d">
    <name>ЗаказПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ce2ae764-1f2c-4aa5-8a79-8f79cb6f46e5">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="9d582038-c1f3-409a-88c7-c60ef602de6b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="baf008fb-7426-45b2-9882-953fb2bafe5b">
    <name>НоменклатураНабора</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4131d997-dafa-404d-a1bc-919ab4f5e5c1">
    <name>ХарактеристикаНабора</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="91dfbf85-19aa-430a-8303-eef0b294382c">
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ТипыДенежныхСредств/ТипыДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f99ea38a-e7dd-4cf2-baef-9f45b84e14c5">
  <name>ТипыДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="af55f18c-5849-41ae-9408-25553d915add">
    <name>Безналичные</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b0b38bad-1d96-4998-b1c0-7fb6ccd93d16">
    <name>Наличные</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/ПульсБизнеса/ManagerModule.bsl
Процедура Подключаемый_ам_ДопПоказателиРасчет(Запрос, Стр, Индекс, Параметры) Экспорт
	
	Если Стр.Ресурс="ОтицательныйОстаток" Тогда
		ТекстРесурса = "СУММА(Рег.КоличествоОстаток)";
	ИначеЕсли Стр.Ресурс="СуммаОстатокПоУчетнымЦенам" Тогда
		ТекстРесурса = "СУММА(ВЫРАЗИТЬ(Рег.КоличествоОстаток * УчетныеЦены.Цена КАК ЧИСЛО(15, 2)))";
	ИначеЕсли Стр.Ресурс="КоличествоОстатокПоЗаказамПоставщикам" Тогда
		ТекстРесурса = "СУММА(Рег.КоличествоОстаток)";
	ИначеЕсли Стр.Ресурс="СуммаОстатокПоЗаказамПоставщикам" Тогда
		ТекстРесурса = "СУММА(ЕСТЬNULL(ЗаказПоставщикуЗапасы.Цена, 0) * Рег.КоличествоОстаток)";
	ИначеЕсли Стр.Ресурс="КоличествоЧековВозврат" Тогда
		ТекстРесурса = "СУММА(Рег.КоличествоЧековВозврат)";
	ИначеЕсли Стр.Ресурс="КоличествоЧековПродажа" Тогда
		ТекстРесурса = "СУММА(Рег.КоличествоЧековПродажа)";
	ИначеЕсли Стр.Ресурс="КоличествоЧековПредоплата" Тогда
		ТекстРесурса = "КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Рег.Документ)";
	ИначеЕсли Стр.Ресурс="СуммаЧековПредоплата" Тогда
		ТекстРесурса = "СУММА(Рег.Сумма)";
	ИначеЕсли Стр.Ресурс="СуммаЧековВозврат" Тогда
		ТекстРесурса = "СУММА(Рег.СуммаВозврат)";
	ИначеЕсли Стр.Ресурс="СуммаЧековПродажа" Тогда
		ТекстРесурса = "СУММА(Рег.СуммаВыручки)+СУММА(Рег.СуммаВозврат)";
	ИначеЕсли Стр.Ресурс="СреднийЧекПоПродажам" Тогда
		ТекстРесурса = "ВЫБОР КОГДА СУММА(Рег.КоличествоЧековПродажа) = 0 ТОГДА 0 ИНАЧЕ (СУММА(Рег.СуммаВыручки) + СУММА(Рег.СуммаВозврат)) / СУММА(Рег.КоличествоЧековПродажа)	КОНЕЦ";
	ИначеЕсли Стр.Ресурс="ПоступлениеНаличныхВКассыККМ" Тогда
		ТекстРесурса = "СУММА(Рег.Сумма)";
	ИначеЕсли Стр.Ресурс="ВыбытиеНаличныхИзКассыККМ" Тогда
		ТекстРесурса = "СУММА(Рег.Сумма)";
	ИначеЕсли Стр.Ресурс="ПолученоОплатКартой" Тогда
		ТекстРесурса = "СУММА(Рег.Приход)";
	ИначеЕсли Стр.Ресурс="ВозвратОплатКартой" Тогда
		ТекстРесурса = "СУММА(Рег.Расход)";
	ИначеЕсли Стр.Ресурс="ПередачаНаличныхВСейф" Тогда
		ТекстРесурса = "СУММА(Рег.СуммаОстаток)";
	ИначеЕсли Стр.Ресурс="ВыдачаНаличныхИзСейфа" Тогда
		ТекстРесурса = "СУММА(Рег.Сумма)";
	Иначе
		Возврат;
	КонецЕсли; 
	
	Если Стр.Ресурс="ОтицательныйОстаток" Тогда
		ТекстЭлемента =  
		"ВЫБРАТЬ
		|	&ДляСравнения КАК ДляСравнения,
		|	&Индекс КАК Индекс,
		|	&Разделитель КАК Разделитель,
		|	&Ресурс КАК Значение
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(Рег.КоличествоОстаток) КАК КоличествоОстаток,
		|		Рег.Номенклатура КАК Номенклатура,
		|		Рег.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|	ИЗ
		|		РегистрНакопления.Запасы.Остатки(&Период, СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Запасы)) КАК Рег
		|	ГДЕ
		|		Рег.КоличествоОстаток < 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Рег.Номенклатура,
		|		Рег.СтруктурнаяЕдиница) КАК Рег
		|СГРУППИРОВАТЬ ПО &Группировки";
	ИначеЕсли Стр.Ресурс="СуммаОстатокПоУчетнымЦенам" Тогда
		ТекстЭлемента =  
		"ВЫБРАТЬ
		|   &ДляСравнения КАК ДляСравнения, 
		|   &Индекс КАК Индекс, 
		|   &Разделитель КАК Разделитель, 
		|	&Ресурс КАК Значение
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(&Период, СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Запасы)) КАК Рег
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.Учетная)) КАК УчетныеЦены
		|		ПО Рег.Номенклатура = УчетныеЦены.Номенклатура
		|			И Рег.Характеристика = УчетныеЦены.Характеристика
		|ГДЕ &Отборы
		|СГРУППИРОВАТЬ ПО &Группировки";
	ИначеЕсли Стр.Ресурс="КоличествоОстатокПоЗаказамПоставщикам"
		ИЛИ Стр.Ресурс="СуммаОстатокПоЗаказамПоставщикам" Тогда
		ТекстЭлемента =  
		"ВЫБРАТЬ
		|   &ДляСравнения КАК ДляСравнения, 
		|   &Индекс КАК Индекс, 
		|   &Разделитель КАК Разделитель, 
		|	&Ресурс КАК Значение
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Период, ) КАК Рег
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
		|		ПО Рег.ЗаказПоставщику = ЗаказПоставщикуЗапасы.Ссылка
		|			И Рег.Номенклатура = ЗаказПоставщикуЗапасы.Номенклатура
		|			И Рег.Характеристика = ЗаказПоставщикуЗапасы.Характеристика
		|ГДЕ &Отборы
		|СГРУППИРОВАТЬ ПО &Группировки";
	ИначеЕсли Стр.Ресурс="КоличествоЧековПродажа" ИЛИ Стр.Ресурс="КоличествоЧековВозврат" 
		ИЛИ Стр.Ресурс="СуммаЧековПродажа" ИЛИ Стр.Ресурс="СуммаЧековВозврат" ИЛИ Стр.Ресурс="СреднийЧекПоПродажам" Тогда
		ТекстЭлемента = 
		"ВЫБРАТЬ
		|	&ДляСравнения КАК ДляСравнения,
		|	&Индекс КАК Индекс,
		|	Рег.Разделитель КАК Разделитель,
		|	&Ресурс КАК Значение
		|ИЗ
		|	(ВЫБРАТЬ
		|		&Разделитель КАК Разделитель,
		|		ПродажиОбороты.Документ.КассаККМ КАК КассаККМ,
		|		ПродажиОбороты.Организация КАК Организация,
		|		ПродажиОбороты.Документ.Контрагент КАК Контрагент,
		|		ПродажиОбороты.Подразделение КАК Подразделение,
		|		ПродажиОбороты.Документ.СтруктурнаяЕдиница КАК Склад,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|				КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЧекККМ
		|						ИЛИ ПродажиОбороты.Регистратор ССЫЛКА Документ.ЧекККМВозврат
		|					ТОГДА ПродажиОбороты.Регистратор
		|				КОГДА ДокументЧекККМ.Ссылка ССЫЛКА Документ.ЧекККМ
		|					ТОГДА ДокументЧекККМ.Ссылка
		|				КОГДА ДокументЧекККМВозврат.Ссылка ССЫЛКА Документ.ЧекККМВозврат
		|					ТОГДА ДокументЧекККМВозврат.Ссылка
		|			КОНЕЦ) КАК КоличествоЧеков,
		|		0 КАК КоличествоЧековПродажа,
		|		0 КАК КоличествоЧековВозврат,
		|		0 КАК СуммаВыручки,
		|		0 КАК СуммаВозврат
		|	ИЗ
		|		РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Авто, ) КАК ПродажиОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ДокументЧекККМ
		|			ПО ПродажиОбороты.Регистратор = ДокументЧекККМ.КассоваяСмена
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат КАК ДокументЧекККМВозврат
		|			ПО ПродажиОбороты.Регистратор = ДокументЧекККМВозврат.КассоваяСмена
		|	ГДЕ
		|		(ПродажиОбороты.Документ ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				ИЛИ ПродажиОбороты.Документ ССЫЛКА Документ.ЧекККМ)
		|		И ПродажиОбороты.КоличествоОборот <> 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПродажиОбороты.Подразделение,
		|		ПродажиОбороты.Документ.КассаККМ,
		|		ПродажиОбороты.Организация,
		|		ПродажиОбороты.Документ.СтруктурнаяЕдиница,
		|		ПродажиОбороты.Документ.Контрагент
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		&Разделитель,
		|		ПродажиОбороты.Документ.КассаККМ,
		|		ПродажиОбороты.Организация,
		|		ПродажиОбороты.Документ.Контрагент,
		|		ПродажиОбороты.Подразделение,
		|		ПродажиОбороты.Документ.СтруктурнаяЕдиница,
		|		0,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|				КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЧекККМ
		|					ТОГДА ПродажиОбороты.Регистратор
		|				КОГДА ДокументЧекККМ.Ссылка ССЫЛКА Документ.ЧекККМ
		|					ТОГДА ДокументЧекККМ.Ссылка
		|			КОНЕЦ),
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Авто, ) КАК ПродажиОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ДокументЧекККМ
		|			ПО ПродажиОбороты.Регистратор = ДокументЧекККМ.КассоваяСмена
		|	ГДЕ
		|		(ПродажиОбороты.Документ ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				ИЛИ ПродажиОбороты.Документ ССЫЛКА Документ.ЧекККМ)
		|		И ПродажиОбороты.КоличествоОборот <> 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПродажиОбороты.Подразделение,
		|		ПродажиОбороты.Документ.КассаККМ,
		|		ПродажиОбороты.Организация,
		|		ПродажиОбороты.Документ.СтруктурнаяЕдиница,
		|		ПродажиОбороты.Документ.Контрагент
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		&Разделитель,
		|		ПродажиОбороты.Документ.КассаККМ,
		|		ПродажиОбороты.Организация,
		|		ПродажиОбороты.Документ.Контрагент,
		|		ПродажиОбороты.Подразделение,
		|		ПродажиОбороты.Документ.СтруктурнаяЕдиница,
		|		0,
		|		0,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|				КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЧекККМВозврат
		|					ТОГДА ПродажиОбороты.Регистратор
		|				КОГДА ДокументЧекККМВозврат.Ссылка ССЫЛКА Документ.ЧекККМВозврат
		|					ТОГДА ДокументЧекККМВозврат.Ссылка
		|			КОНЕЦ),
		|		0,
		|		0
		|	ИЗ
		|		РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Авто, ) КАК ПродажиОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат КАК ДокументЧекККМВозврат
		|			ПО ПродажиОбороты.Регистратор = ДокументЧекККМВозврат.КассоваяСмена
		|	ГДЕ
		|		(ПродажиОбороты.Документ ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				ИЛИ ПродажиОбороты.Документ ССЫЛКА Документ.ЧекККМ)
		|		И ПродажиОбороты.КоличествоОборот <> 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПродажиОбороты.Подразделение,
		|		ПродажиОбороты.Документ.КассаККМ,
		|		ПродажиОбороты.Организация,
		|		ПродажиОбороты.Документ.СтруктурнаяЕдиница,
		|		ПродажиОбороты.Документ.Контрагент
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		&Разделитель,
		|		ПродажиОбороты.Документ.КассаККМ,
		|		ПродажиОбороты.Организация,
		|		ПродажиОбороты.Документ.Контрагент,
		|		ПродажиОбороты.Документ.Подразделение,
		|		ПродажиОбороты.Документ.СтруктурнаяЕдиница,
		|		0,
		|		0,
		|		0,
		|		СУММА(ПродажиОбороты.СуммаОборот),
		|		0
		|	ИЗ
		|		РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Авто, ) КАК ПродажиОбороты
		|	ГДЕ
		|		(ПродажиОбороты.Документ ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				ИЛИ ПродажиОбороты.Документ ССЫЛКА Документ.ЧекККМ)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПродажиОбороты.Документ.Подразделение,
		|		ПродажиОбороты.Документ.КассаККМ,
		|		ПродажиОбороты.Документ.Контрагент,
		|		ПродажиОбороты.Организация,
		|		ПродажиОбороты.Документ.СтруктурнаяЕдиница
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		&Разделитель,
		|		Продажи.Документ.КассаККМ,
		|		Продажи.Организация,
		|		Продажи.Документ.Контрагент,
		|		Продажи.Документ.Подразделение,
		|		Продажи.Документ.СтруктурнаяЕдиница,
		|		0,
		|		0,
		|		0,
		|		0,
		|		СУММА(-1 * Продажи.Сумма)
		|	ИЗ
		|		РегистрНакопления.Продажи КАК Продажи
		|	ГДЕ
		|		Продажи.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И Продажи.Сумма < 0
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Продажи.Документ.Подразделение,
		|		Продажи.Документ.КассаККМ,
		|		Продажи.Документ.Контрагент,
		|		Продажи.Организация,
		|		Продажи.Документ.СтруктурнаяЕдиница) КАК Рег
		|ГДЕ
		|	&Отборы
		|
		|СГРУППИРОВАТЬ ПО
		|	Рег.Разделитель";
	ИначеЕсли Стр.Ресурс="ПоступлениеНаличныхВКассыККМ" Тогда
		ТекстЭлемента =  
		"ВЫБРАТЬ
		|	&ДляСравнения КАК ДляСравнения,
		|	&Индекс КАК Индекс,
		|	&Разделитель КАК Разделитель,
		|	&Ресурс КАК Значение
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПоступлениеВКассахККМ.Организация КАК Организация,
		|		ПоступлениеВКассахККМ.КассаККМ КАК КассаККМ,
		|		ПоступлениеВКассахККМ.Регистратор КАК Регистратор,
		|		ПоступлениеВКассахККМ.СуммаОборот КАК Сумма
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредстваВКассахККМ.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ПоступлениеВКассахККМ
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(ПоступлениеВКассахККМ.Регистратор) = ТИП(Документ.ЧекККМ)) КАК Рег
		|ГДЕ
		|	&Отборы
		|СГРУППИРОВАТЬ ПО &Группировки";
	ИначеЕсли Стр.Ресурс="ВыбытиеНаличныхИзКассыККМ" Тогда
		ТекстЭлемента =  
		"ВЫБРАТЬ
		|	&ДляСравнения КАК ДляСравнения,
		|	&Индекс КАК Индекс,
		|	&Разделитель КАК Разделитель,
		|	&Ресурс КАК Значение
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВыбытиеВКассахККМ.Организация КАК Организация,
		|		ВыбытиеВКассахККМ.КассаККМ КАК КассаККМ,
		|		ВыбытиеВКассахККМ.Регистратор КАК Регистратор,
		|		-ВыбытиеВКассахККМ.СуммаОборот КАК Сумма
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредстваВКассахККМ.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ВыбытиеВКассахККМ
		|	ГДЕ
		|		ТИПЗНАЧЕНИЯ(ВыбытиеВКассахККМ.Регистратор) В (ТИП(Документ.ЧекККМВозврат), ТИП(Документ.ВыемкаНаличных))) КАК Рег
		|ГДЕ
		|	&Отборы
		|СГРУППИРОВАТЬ ПО &Группировки";
	ИначеЕсли Стр.Ресурс="ПолученоОплатКартой" ИЛИ Стр.Ресурс="ВозвратОплатКартой" Тогда
		ТекстЭлемента = 
		"ВЫБРАТЬ
		|	&ДляСравнения КАК ДляСравнения,
		|	&Индекс КАК Индекс,
		|	&Разделитель КАК Разделитель,
		|	&Ресурс КАК Значение
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОплатаПлатежнымиКартами.Организация КАК Организация,
		|		ОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|		ОплатаПлатежнымиКартами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		ОплатаПлатежнымиКартами.ЭквайринговыйТерминал.Касса КАК КассаККМ,
		|		ОплатаПлатежнымиКартами.Регистратор КАК Регистратор,
		|		ВЫБОР
		|			КОГДА ОплатаПлатежнымиКартами.Сумма > 0
		|				ТОГДА ОплатаПлатежнымиКартами.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК Приход,
		|		ВЫБОР
		|			КОГДА ОплатаПлатежнымиКартами.Сумма < 0
		|				ТОГДА -ОплатаПлатежнымиКартами.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК Расход
		|	ИЗ
		|		РегистрНакопления.ОплатаПлатежнымиКартами КАК ОплатаПлатежнымиКартами
		|	ГДЕ
		|		ОплатаПлатежнымиКартами.Период МЕЖДУ &ДатаНачала И &ДатаОкончания) КАК Рег
		|ГДЕ
		|	&Отборы
		|СГРУППИРОВАТЬ ПО &Группировки";		
	ИначеЕсли Стр.Ресурс="ПередачаНаличныхВСейф" Тогда
		ТекстЭлемента =  
		"ВЫБРАТЬ
		|   &ДляСравнения КАК ДляСравнения, 
		|   &Индекс КАК Индекс, 
		|   &Разделитель КАК Разделитель, 
		|	&Ресурс КАК Значение
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваКПоступлению.Остатки(&Период, ) КАК Рег
		|ГДЕ &Отборы
		|СГРУППИРОВАТЬ ПО &Группировки";
	ИначеЕсли Стр.Ресурс="КоличествоЧековПредоплата" ИЛИ Стр.Ресурс="СуммаЧековПредоплата" Тогда
		ТекстЭлемента = 
		"ВЫБРАТЬ
		|	&ДляСравнения КАК ДляСравнения,
		|	&Индекс КАК Индекс,
		|	&Разделитель КАК Разделитель,
		|	&Ресурс КАК Значение
		|ИЗ
		|	(ВЫБРАТЬ
		|	ПредоплатаПоЧекам.Организация КАК Организация,
		|	ПредоплатаПоЧекам.ТипРасчетов КАК ТипРасчетов,
		|	ПредоплатаПоЧекам.Контрагент КАК Контрагент,
		|	ПредоплатаПоЧекам.Договор КАК Договор,
		|	ПредоплатаПоЧекам.Документ КАК Документ,
		|	ПредоплатаПоЧекам.Заказ КАК Заказ,
		|	ПредоплатаПоЧекам.СуммаРасход КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыСПокупателями.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			,
		|			ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|				И ТИПЗНАЧЕНИЯ(Документ) В (ТИП(Документ.ЧекККМ))) КАК ПредоплатаПоЧекам) КАК Рег
		|ГДЕ
		|	&Отборы
		|СГРУППИРОВАТЬ ПО &Группировки";
	ИначеЕсли Стр.Ресурс="ВыдачаНаличныхИзСейфа" Тогда
		ТекстЭлемента = 
		"ВЫБРАТЬ
		|	&ДляСравнения КАК ДляСравнения,
		|	&Индекс КАК Индекс,
		|	&Разделитель КАК Разделитель,
		|	&Ресурс КАК Значение
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВыбытиеДС.Организация КАК Организация,
		|		ВыбытиеДС.БанковскийСчетКасса КАК Касса,
		|		ВыбытиеДС.Регистратор КАК Регистратор,
		|		ВыбытиеДС.СуммаРасход КАК Сумма
		|	ИЗ
		|		РегистрНакопления.ДенежныеСредства.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ТипДенежныхСредств = Значение(Перечисление.ТипыДенежныхСредств.Наличные)) КАК ВыбытиеДС
		|	ГДЕ
		|		ВЫРАЗИТЬ(ВыбытиеДС.Регистратор КАК Документ.РасходИзКассы).ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.Покупателю), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ))) КАК Рег
		|ГДЕ
		|	&Отборы
		|СГРУППИРОВАТЬ ПО &Группировки";
	КонецЕсли; 
	
	ТекстЭлемента = СтрЗаменить(
	ТекстЭлемента,
	"&Ресурс",
	ТекстРесурса);
	ДобавитьЭлементВЗапросПоказатели(Запрос, ТекстЭлемента, Стр, Индекс, Параметры);
	
КонецПроцедуры
